Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: gMock has a **built-in default action** for any function that returns `void`, `bool`, a numeric value, or a pointer.
it_it: gMock ha un'**azione di default nativa** per qualsiasi funzione che restituisce `void`, `bool`, un valore numerico o un puntatore.

source: gMock has a built-in default action for any function that returns void, bool, a numeric value, or a pointer.
it_it: gMock ha un'azione di default nativa per qualsiasi funzione che restituisce void, bool, un valore numerico o un puntatore.

source: gMock is bundled with googletest.
it_it: gMock è allegato a googletest.

source: gMock lets you make the decision on a per-mock-object basis.
it_it: gMock consente di decidere per ciascun oggetto mock.

source: gMock matchers are statically typed, meaning that the compiler can catch your mistake if you use a matcher of the wrong type (for example, if you use Eq(5) to match a string argument).
it_it: I matcher di gMock sono tipizzati staticamente, il che significa che il compilatore può individuare l'errore se si usa un matcher del tipo sbagliato (ad esempio, se si usa Eq(5) per trovare una corrispondenza con un argomento string).

source: gMock matchers are statically typed, meaning that the compiler can catch your mistake if you use a matcher of the wrong type (for example, if you use `Eq(5)` to match a `string` argument).
it_it: I matcher di gMock sono tipizzati staticamente, il che significa che il compilatore può individuare l'errore se si usa un matcher del tipo sbagliato (ad esempio, se si usa `Eq(5)` per trovare una corrispondenza con un argomento `string`).

source: gMock prints a warning when a function without EXPECT_CALL is called, even if I have set its behavior using ON_CALL.
it_it: gMock stampa un warning quando viene chiamata una funzione senza EXPECT_CALL, anche se ho impostato il suo comportamento utilizzando ON_CALL.

source: gMock provides a generic *action adaptor*, so you can spend your time minding more important business than writing your own adaptors.
it_it: gMock fornisce un *action adaptor* generico, così ci si può dedicare agli affari più importanti piuttosto che scrivere i propri adaptor.

source: gMock provides a generic action adaptor, so you can spend your time minding more important business than writing your own adaptors.
it_it: gMock fornisce un action adaptor generico, così ci si può dedicare agli affari più importanti piuttosto che scrivere i propri adaptor.

source: gMock provides a set of built-in matchers for matching arguments with expected values—see the Matchers Reference for more information.
it_it: gMock fornisce un insieme di matcher nativi per far corrispondere gli argomenti con i valori attesi: per ulteriori informazioni consultare i Riferimenti ai Matcher.

source: gMock provides a set of built-in matchers for matching arguments with expected values—see the [Matchers Reference](reference/matchers.md) for more information.
it_it: gMock fornisce un insieme di matcher nativi per far corrispondere gli argomenti con i valori attesi: per ulteriori informazioni consultare i [Riferimenti ai Matcher](reference/matchers.md).

source: gMock provides the necessary means for you to do it "just right."
it_it: gMock fornisce i mezzi necessari per farlo "nel modo giusto".

source: gMock sucks!
it_it: gMock fa schifo!

source: gMock takes care of the locking, so you don't have to do any - unless required by your test logic.
it_it: gMock si occupa del locking, quindi non si deve fare nulla, a meno che non sia richiesto dalla logica del test.

source: gMock was built to help C++ programmers.
it_it: gMock è stato creato per aiutare i programmatori C++.

source: gMock will catch any violation to the expectations as soon as it arises.
it_it: gMock rileverà qualsiasi violazione delle aspettative non appena si presentano.

source: gMock will verify the expectations on a mock object when it is destructed, or you can do it earlier:
it_it: gMock verificherà le expectation su un oggetto mock quando viene distrutto, oppure lo si può fare prima:

source: gMock works for this purpose too.
it_it: gMock funziona anche per questo scopo.

source: how many times?
it_it: Quante volte?

source: if Foo(1) is called in thread 1 and Foo(2) is called in thread 2, gMock will execute action1 in thread 1 and action2 in thread 2.
it_it: se Foo(1) viene chiamato nel thread 1 e Foo(2) viene chiamato nel thread 2, gMock eseguirà action1 nel thread 1 e action2 nel thread 2.

source: if `Foo(1)` is called in thread 1 and `Foo(2)` is called in thread 2, gMock will execute `action1` in thread 1 and `action2` in thread 2.
it_it: se `Foo(1)` viene chiamato nel thread 1 e `Foo(2)` viene chiamato nel thread 2, gMock eseguirà `action1` nel thread 1 e `action2` nel thread 2.

source: if you are expecting a non-fatal (e.g. EXPECT_*) failure.
it_it: se ci si aspetta un errore non fatale (per es. EXPECT_*).

source: if you are expecting a non-fatal (e.g. `EXPECT_*`) failure.
it_it: se ci si aspetta un errore non fatale (per es. `EXPECT_*`).

source: if you run it with --gmock_verbose=info, you will see this output:
it_it: se lo si esegue con --gmock_verbose=info, si vedrà questo output:

source: if you run it with `--gmock_verbose=info`, you will see this output:
it_it: se lo si esegue con `--gmock_verbose=info`, si vedrà questo output:

source: in a namespace scope (i.e. not inside a class or function), you will define an action with the given name that executes the statements.
it_it: nello scope di un namespace (cioè non all'interno di una classe o funzione), si definirà un'azione con il nome dato che esegue le istruzioni.

source: in which order?
it_it: In quale ordine?

source: instead of
it_it: invece di

source: instead of a more opaque
it_it: invece di un più opaco

source: instead of:
it_it: invece di:

source: int Factorial(int n); // Returns the factorial of n
it_it: int Factorial(int n); // Restituisce il fattoriale di n

source: int SmallestPrimeCommonDivisor(int m, int n) { ... } // Returns true if m and n have no common divisors except 1.
it_it: int SmallestPrimeCommonDivisor(int m, int n) { ... } // Restituisce true se m e n non hanno divisori comuni tranne 1.

source: int multiplier; }; // Then use: // EXPECT_CALL(...).WillOnce(MultiplyBy{7});
it_it: int multiplier; }; // Poi si usa: // EXPECT_CALL(...).WillOnce(MultiplyBy{7});

source: int y; }; // If you can't declare the function in the class it's important that PrintTo() // is defined in the SAME namespace that defines Point.
it_it: int y; }; // Se non si può dichiarare la funzione nella classe è importante che PrintTo() // sia definito nello STESSO spazio dei nomi che definisce Point.

source: int y; }; // If you can't declare the function in the class it's important that the // AbslStringify overload is defined in the SAME namespace that defines Point.
it_it: int y; }; // Se non è possibile dichiarare la funzione nella classe, è importante che // l'overload AbslStringify sia definito nello STESSO spazio dei nomi che definisce Point.

source: int* p = std::get<0>(args); // Grabs the first argument.
it_it: int* p = std::get<0>(args); // Cattura il primo argomento.

source: is a matcher that matches a Foo object whose bar member variable satisfies matcher m.
it_it: è un matcher che corrisponde a un oggetto Foo la cui variabile membro bar soddisfa il matcher m.

source: is a matcher that matches a Foo object whose baz() method returns a value that satisfies matcher m.
it_it: è un matcher che corrisponde a un oggetto Foo il cui metodo baz() restituisce un valore che soddisfa il matcher m.

source: is a matcher that matches a `Foo` object whose `bar` member variable satisfies matcher `m`.
it_it: è un matcher che corrisponde a un oggetto `Foo` la cui variabile membro `bar` soddisfa il matcher `m`.

source: is a matcher that matches a `Foo` object whose `baz()` method returns a value that satisfies matcher `m`.
it_it: è un matcher che corrisponde a un oggetto `Foo` il cui metodo `baz()` restituisce un valore che soddisfa il matcher `m`.

source: kFatalFailure, // Failed and the test should be terminated.
it_it: kFatalFailure, // Fallito e il test deve essere terminato.

source: kNonFatalFailure, // Failed but the test can continue.
it_it: kNonFatalFailure, // Fallito ma il test può continuare.

source: kSkip // Skipped.
it_it: kSkip // Saltato [skip].

source: kSuccess, // Succeeded.
it_it: kSuccess, // Operazione riuscita.

source: lets you write
it_it: permette di scrivere

source: matcher.DescribeTo(os); matcher.DescribeNegationTo(os); // where `os` is of type `std::ostream*`.
it_it: matcher.DescribeTo(os); matcher.DescribeNegationTo(os); // dove `os` è di tipo `std::ostream*`.

source: matches 0 or 1 occurrences of A
it_it: corrisponde a 0 o 1 occorrenze di A

source: matches 0 or 1 occurrences of `A`
it_it: corrisponde a 0 o 1 occorrenze di `A`

source: matches 0 or many occurrences of A
it_it: corrisponde a 0 o più occorrenze di A

source: matches 0 or many occurrences of `A`
it_it: corrisponde a 0 o più occorrenze di `A`

source: matches 1 or many occurrences of A
it_it: corrisponde a 1 o più occorrenze di A

source: matches 1 or many occurrences of `A`
it_it: corrisponde a 0 o più occorrenze di `A`

source: matches \f
it_it: corrisponde a \f

# matches
source: matches \n
it_it: corrisponde a \n

# matches
source: matches \r
it_it: corrisponde a \r

# matches
source: matches \t
it_it: corrisponde a \t

source: matches \v
it_it: corrisponde a \v

source: matches x followed by y
it_it: corrisponde a x seguito da y

source: matches `\f`
it_it: corisponde a `\f`

# matches ` `
source: matches `\n`
it_it: corisponde a `\n`

# matches ``
source: matches `\r`
it_it: corisponde a `\r`

# matches ` `
source: matches `\t`
it_it: corisponde a `\t`

source: matches `\v`
it_it: corisponde a `\v`

source: matches `x` followed by `y`
it_it: corrisponde a `x` seguito da `y`

source: matches a plain pointer p where p->number >= 3.
it_it: corrisponde a un semplice puntatore p dove p->number >= 3.

source: matches a plain pointer `p` where `p->number >= 3`.
it_it: corrisponde a un semplice puntatore `p` dove `p->number >= 3`.

# matches any ASCII whitespace, including
source: matches any ASCII whitespace, including \n
it_it: corrisponde a qualsiasi spazio 'bianco' ASCII, incluso \n

# matches any ASCII whitespace, including ` `
source: matches any ASCII whitespace, including `\n`
it_it: corrisponde a qualsiasi spazio 'bianco' ASCII, incluso `\n`

source: matches any character that \\w doesn't match
it_it: corrisponde a qualsiasi carattere che non corrisponde a \\w

source: matches any character that `\\w` doesn't match
it_it: corrisponde a qualsiasi carattere che non corrisponde a `\\w`

source: matches any character that's not a decimal digit
it_it: corrisponde a qualsiasi carattere che non sia una cifra decimale

source: matches any character that's not a whitespace
it_it: corrisponde a qualsiasi carattere che non sia uno spazio 'bianco'

source: matches any decimal digit
it_it: corrisponde a qualsiasi cifra decimale

source: matches any letter, _, or decimal digit
it_it: corrisponde a qualsiasi lettera, _, o cifra decimale

source: matches any letter, `_`, or decimal digit
it_it: corrisponde a qualsiasi lettera, `_`, o cifra decimale

source: matches any literal character c
it_it: corrisponde a qualsiasi carattere letterale c

source: matches any literal character c, which must be a punctuation
it_it: corrisponde a qualsiasi carattere letterale c, che deve essere un segno di punteggiatura

source: matches any literal character `c`
it_it: corrisponde a qualsiasi carattere letterale `c`

source: matches any literal character `c`, which must be a punctuation
it_it: corrisponde a qualsiasi carattere letterale `c`, che deve essere un segno di punteggiatura

# matches any single character except
source: matches any single character except \n
it_it: corrisponde a qualsiasi carattere singolo tranne \n

# matches any single character except ` `
source: matches any single character except `\n`
it_it: corrisponde a qualsiasi carattere singolo tranne `\n`

source: matches the beginning of a string (not that of each line)
it_it: corrisponde all'inizio di una stringa (non a quello di ogni riga)

source: matches the end of a string (not that of each line)
it_it: corrisponde alla fine di una stringa (non a quella di ogni riga)

source: namespace foo { class Point { // We want GoogleTest to be able to print instances of this.
it_it: namespace foo { class Point { // Vogliamo che GoogleTest sia in grado di stamparne le istanze.

source: namespace testing { // Returns an AssertionResult object to indicate that an assertion has // succeeded.
it_it: namespace testing { // Restituisce un oggetto AssertionResult per indicare che // un'asserzione ha avuto successo..

source: necessary macro (-D) definitions
it_it: le definizioni di macro necessarie (-D)

source: next, you create some mock objects and specify its expectations and behavior using an intuitive syntax;
it_it: successivamente, si creano alcuni oggetti mock e se ne specificano le aspettative e il comportamento utilizzando una sintassi intuitiva;

source: or tell the mock object that you don't want to mock Concrete():
it_it: oppure dire al mock dell'oggetto che non si vuole il mock di Concrete():

source: or tell the mock object that you don't want to mock `Concrete()`:
it_it: oppure dire al mock dell'oggetto che non si vuole il mock di `Concrete()`:

source: or you can put the sequence of actions in the same expectation:
it_it: oppure si può mettere la sequenza di azioni nella stessa expectation:

source: or,
it_it: o,

source: otherwise pkg-config will filter -I and -L flags against standard prefixes such as /usr (see https://bugs.freedesktop.org/show_bug.cgi?id=28264#c3 for reasons why this stripping needs to occur usually).
it_it: altrimenti pkg-config filtrerà i flag -I e -L rispetto ai prefissi standard come /usr (vedere https://bugs.freedesktop.org/show_bug.cgi?id=28264#c3 per i motivi per cui di solito è necessario eseguire questa rimozione).

source: otherwise `pkg-config` will filter `-I` and `-L` flags against standard prefixes such as `/usr` (see https://bugs.freedesktop.org/show_bug.cgi?id=28264#c3 for reasons why this stripping needs to occur usually).
it_it: altrimenti `pkg-config` filtrerà i flag `-I` e `-L` rispetto ai prefissi standard come `/usr` (vedere https://bugs.freedesktop.org/show_bug.cgi?id=28264#c3 per i motivi per cui di solito è necessario eseguire questa rimozione).

source: pkg-config can't find GoogleTest!
it_it: pkg-config non trova GoogleTest!

source: pkg-config will also try to look in PKG_CONFIG_PATH to find gtest_main.pc.
it_it: pkg-config proverà anche a cercare in PKG_CONFIG_PATH per trovare gtest_main.pc.

source: pkg-config will also try to look in `PKG_CONFIG_PATH` to find `gtest_main.pc`.
it_it: pkg-config proverà anche a cercare in `PKG_CONFIG_PATH` per trovare `gtest_main.pc`.

source: says that Blah will be called with arguments x, y, and z where x < y < z.
it_it: dice che Blah verrà chiamato con gli argomenti x, y e z dove x < y < z.

source: says that turtle.GetX() will be called exactly three times (gMock inferred this from how many WillOnce() clauses we've written, since we didn't explicitly write Times()), and will return 100, 200, and 300 respectively.
it_it: dice che turtle.GetX() verrà chiamata esattamente tre volte (gMock lo ha dedotto da quante clausole WillOnce() abbiamo scritto, poiché non abbiamo scritto esplicitamente Times()), e restituirà rispettivamente 100, 200 e 300.

source: says that turtle.GetY() will be called at least twice (gMock knows this as we've written two WillOnce() clauses and a WillRepeatedly() while having no explicit Times()), will return 100 and 200 respectively the first two times, and 300 from the third time on.
it_it: dice che turtle.GetY() sarà chiamata almeno due volte (gMock lo sa perché abbiamo scritto due clausole WillOnce() e una WillRepeatedly() pur non avendo esplicitato Times()), restituirà 100 e 200 rispettivamente le prime due volte e 300 dalla terza volta in poi.

source: says that `Blah` will be called with arguments `x`, `y`, and `z` where `x < y < z`.
it_it: dice che `Blah` verrà chiamato con gli argomenti `x`, `y`, e `z` dove `x < y < z`.

source: says that `turtle.GetX()` will be called *exactly three times* (gMock inferred this from how many `WillOnce()` clauses we've written, since we didn't explicitly write `Times()`), and will return 100, 200, and 300 respectively.
it_it: dice che `turtle.GetX()` verrà chiamata *esattamente tre volte* (gMock lo ha dedotto da quante clausole `WillOnce()` abbiamo scritto, poiché non abbiamo scritto esplicitamente `Times()`), e restituirà rispettivamente 100, 200 e 300.

source: says that `turtle.GetY()` will be called *at least twice* (gMock knows this as we've written two `WillOnce()` clauses and a `WillRepeatedly()` while having no explicit `Times()`), will return 100 and 200 respectively the first two times, and 300 from the third time on.
it_it: dice che `turtle.GetY()` sarà chiamata *almeno due volte* (gMock lo sa perché abbiamo scritto due clausole `WillOnce()` e una `WillRepeatedly()` pur non avendo esplicitato `Times()`), restituirà 100 e 200 rispettivamente le prime due volte e 300 dalla terza volta in poi.

source: says that the turtle object's GetX() method will be called five times, it will return 100 the first time, 150 the second time, and then 200 every time.
it_it: dice che il metodo turtle dell'oggetto GetX() verrà chiamato cinque volte, restituirà 100 la prima volta, 150 la seconda volta e poi 200 ogni volta.

source: says that the `turtle` object's `GetX()` method will be called five times, it will return 100 the first time, 150 the second time, and then 200 every time.
it_it: dice che il metodo `turtle` dell'oggetto `GetX()` verrà chiamato cinque volte, restituirà 100 la prima volta, 150 la seconda volta e poi 200 ogni volta.

source: says that the first argument of InRange() must not be 0, and must be less than the second argument.
it_it: dice che il primo argomento di InRange() non deve essere 0 e deve essere minore del secondo argomento.

source: says that the first argument of `InRange()` must not be 0, and must be less than the second argument.
it_it: dice che il primo argomento di `InRange()` non deve essere 0 e deve essere minore del secondo argomento.

source: says that there will be exactly one warning with the message "File too large.".
it_it: dice che ci sarà esattamente un warning con il messaggio"File too large.".

source: says that there will be exactly one warning with the message `"File too large."`.
it_it: dice che ci sarà esattamente un warning con il messaggio `"File too large."`.

source: specifies the following DAG (where s1 is A -> B, and s2 is A -> C -> D):
it_it: specifica il seguente DAG (dove s1 è A -> B e s2 è A -> C -> D):

source: specifies the following DAG (where `s1` is `A -> B`, and `s2` is `A -> C -> D`):
it_it: specifica il seguente DAG (dove `s1` è `A -> B` e `s2` è `A -> C -> D`):

source: template <typename E> // E is the element type.
it_it: template <typename E> // E è il tipo dell'elemento.

source: the expected crash won't kill the test program (i.e. the parent process).
it_it: il crash previsto non kill-erà il programma di test (ovvero il processo principale).

source: the code:
it_it: il codice:

source: the failed assertion EXPECT_TRUE(IsEven(Fib(4))) will print:
it_it: l'asserzione fallita, EXPECT_TRUE(IsEven(Fib(4))), stamperà:

source: the failed assertion `EXPECT_TRUE(IsEven(Fib(4)))` will print:
it_it: l'asserzione fallita, `EXPECT_TRUE(IsEven(Fib(4)))`, stamperà:

source: the includedir (-I) path
it_it: Il path di includedir (-I)

source: the library (-L) path
it_it: il path della libreria (-L)

source: the library (-l) to link to
it_it: la libreria da linkare (-l)

source: the result of std::addressof(argument) matches m.
it_it: il risultato di std::addressof(argument) corrisponde a m.

source: the result of `std::addressof(argument)` matches `m`.
it_it: il risultato di `std::addressof(argument)` corrisponde a `m`.

source: the tuple (flag, ptr)
it_it: la tuple (flag, ptr)

source: the tuple `(flag, ptr)`
it_it: la tuple `(flag, ptr)`

source: the type bool
it_it: il tipo bool

source: the type int(bool, int*)
it_it: il tipo int(bool, int*)

source: the type int*
it_it: il tipo int*

source: the type int
it_it: il tipo int

source: the type std::tuple<bool, int*>
it_it: il tipo std::tuple<bool, int*>

source: the type `bool`
it_it: il tipo `bool`

source: the type `int(bool, int*)`
it_it: il tipo `int(bool, int*)`

source: the type `int*`
it_it: il tipo `int*`

source: the type `int`
it_it: il tipo `int`

source: the type `std::tuple<bool, int*>`
it_it: il tipo `std::tuple<bool, int*>`

source: the value of flag
it_it: il valore di flag

source: the value of ptr
it_it: il valore di ptr

source: the value of `flag`
it_it: il valore di `flag`

source: the value of `ptr`
it_it: il valore di `ptr`

source: then you exercise code that uses the mock objects.
it_it: quindi si usa il codice che utilizza gli oggetti mock.

source: they write
it_it: scrivono

source: to assert that statement generates a fatal (e.g. ASSERT_*) failure in the current thread whose message contains the given substring, or use
it_it: per asserire che statement genera un errore fatale (ad esempio ASSERT_*) nel thread corrente il cui messaggio contiene la substring, oppure si usa

source: to assert that `statement` generates a fatal (e.g. `ASSERT_*`) failure in the current thread whose message contains the given `substring`, or use
it_it: per asserire che `statement` genera un errore fatale (ad esempio `ASSERT_*`) nel thread corrente il cui messaggio contiene la `substring`, oppure si usa

source: to assert that types T1 and T2 are the same.
it_it: per asserire (affermare) che i tipi T1 e T2 sono gli stessi.

source: to assert that types `T1` and `T2` are the same.
it_it: per asserire (affermare) che i tipi `T1` e `T2` sono gli stessi.

source: to cause a compiler error.
it_it: per causare un errore del compilatore.

source: try not to free memory in a death test;
it_it: cercare di non liberare la memoria in un death test;

source: using ::testing::Ge; ... // Expects the turtle moves forward by at least 100.
it_it: using ::testing::Ge; ... // Si aspetta che la tartaruga si muova in avanti di almeno 100.

source: using ::testing::Mock; ... // Verifies and removes the expectations on mock_obj; // returns true if and only if successful.
it_it: using ::testing::Mock; ... // Verifica e rimuove le expectation su mock_obj; // restituisce true se e solo se ha successo.

source: using ::testing::SafeMatcherCast; // A base class and a child class.
it_it: using ::testing::SafeMatcherCast; // Una classe base e una classe figlia.

source: using ::testing::_; ... // Expects that the turtle jumps to somewhere on the x=50 line.
it_it: using ::testing::_; ... // Si aspetta che la tartaruga salti da qualche parte sulla linea x=50.

source: verifies that:
it_it: verifica che:

source: versus
it_it: contro

source: virtual void Bar(int i) = 0; // int or const int?
it_it: virtual void Bar(int i) = 0; // int o const int?

source: void DescribeNegationTo(std::ostream* os) const { *os << "is NULL"; } }; // To construct a polymorphic matcher, pass an instance of the class // to MakePolymorphicMatcher().
it_it: void DescribeNegationTo(std::ostream* os) const { *os << "is NULL"; } }; // Per costruire un matcher polimorfico, si passa un'istanza della classe // a MakePolymorphicMatcher().
